################################################################################
# Warning: this is an internal database file and is not intended for other usage
################################################################################
################################################################################
#
# Created by fc (U-2022.12-SP1) internalDesignWriter on Fri Dec  6 16:27:59 2024
#
################################################################################

################################################################################
#
# Units
# time_unit               : 1e-09
# resistance_unit         : 1000000
# capacitive_load_unit    : 1e-15
# voltage_unit            : 1
# current_unit            : 1e-06
# power_unit              : 1e-12
################################################################################

# Implemented: supplies

set_design_attributes -elements . -internal_attribute _mv_data_file_version 1
create_power_domain TOP -include_scope
create_supply_net -domain TOP VDD
create_supply_net -domain TOP VSS
create_supply_port VDD -domain TOP
create_supply_port VSS -domain TOP
connect_supply_net VDD -ports {VDD}
connect_supply_net VSS -ports {VSS}
set_domain_supply_net TOP -primary_power_net VDD -primary_ground_net VSS
add_port_state VDD -state {VDD_ON 0.95}
add_port_state VSS -state {VSS_OFF 0.00}
create_pst top_state -supplies {VDD VSS}
add_pst_state all_on -pst top_state -state {VDD_ON VSS_OFF}
connect_supply_net VDD -ports {ctmi_118/VDD USRAM/genblk1[0].UMEM/VDD USRAM/genblk1[1].UMEM/VDD USRAM/genblk1[2].UMEM/VDD USRAM/genblk1[3].UMEM/VDD ctmi_120/VDD ctmi_122/VDD ctmi_124/VDD ctmi_126/VDD ctmi_128/VDD ctmi_130/VDD ctmi_119/VDD ctmi_121/VDD ctmi_123/VDD ctmi_125/VDD ctmi_127/VDD ctmi_129/VDD ctmi_131/VDD ctmi_112/VDD ctmi_113/VDD ctmi_114/VDD ctmi_115/VDD ctmi_116/VDD ctmi_117/VDD UFSM/ctmi_69/VDD UFSM/MEM_ADDR_reg[7]/VDD UFSM/MEM_IDATA_reg[5]/VDD UFSM/MEM_IDATA_reg[4]/VDD UFSM/MEM_IDATA_reg[3]/VDD UFSM/MEM_IDATA_reg[2]/VDD UFSM/MEM_IDATA_reg[1]/VDD UFSM/MEM_IDATA_reg[0]/VDD UFSM/MEM_ADDR_reg[8]/VDD UFSM/MEM_OEB_reg[3]/VDD UFSM/MEM_ADDR_reg[6]/VDD UFSM/MEM_ADDR_reg[5]/VDD UFSM/MEM_ADDR_reg[4]/VDD UFSM/MEM_ADDR_reg[3]/VDD UFSM/MEM_ADDR_reg[2]/VDD UFSM/MEM_ADDR_reg[1]/VDD UFSM/MEM_ADDR_reg[0]/VDD UFSM/PREV_CE_reg/VDD UFSM/MEM_OEB_reg[2]/VDD UFSM/MEM_OEB_reg[1]/VDD UFSM/MEM_OEB_reg[0]/VDD UFSM/ctmi_71/VDD UFSM/MEM_CE_reg/VDD UFSM/MEM_CSB_reg[1]/VDD UFSM/MEM_CSB_reg[0]/VDD UFSM/MEM_WEB_reg/VDD UFSM/MEM_CSB_reg[2]/VDD UFSM/ctmi_72/VDD UFSM/MEM_IDATA_reg[6]/VDD UFSM/ctmi_73/VDD UFSM/ctmi_75/VDD UFSM/ctmi_76/VDD UFSM/I_1/VDD UFSM/MEM_CSB_reg[3]/VDD UFSM/ctmi_74/VDD UFSM/ctmi_77/VDD UFSM/ctmi_78/VDD UFSM/ctmi_67/VDD UFSM/ctmi_68/VDD UFSM/ctmi_70/VDD UFSM/MEM_IDATA_reg[7]/VDD}
connect_supply_net VSS -ports {ctmi_118/VSS USRAM/genblk1[0].UMEM/VSS USRAM/genblk1[1].UMEM/VSS USRAM/genblk1[2].UMEM/VSS USRAM/genblk1[3].UMEM/VSS ctmi_120/VSS ctmi_122/VSS ctmi_124/VSS ctmi_126/VSS ctmi_128/VSS ctmi_130/VSS ctmi_119/VSS ctmi_121/VSS ctmi_123/VSS ctmi_125/VSS ctmi_127/VSS ctmi_129/VSS ctmi_131/VSS ctmi_112/VSS ctmi_113/VSS ctmi_114/VSS ctmi_115/VSS ctmi_116/VSS ctmi_117/VSS UFSM/ctmi_69/VSS UFSM/MEM_ADDR_reg[7]/VSS UFSM/MEM_IDATA_reg[5]/VSS UFSM/MEM_IDATA_reg[4]/VSS UFSM/MEM_IDATA_reg[3]/VSS UFSM/MEM_IDATA_reg[2]/VSS UFSM/MEM_IDATA_reg[1]/VSS UFSM/MEM_IDATA_reg[0]/VSS UFSM/MEM_ADDR_reg[8]/VSS UFSM/MEM_OEB_reg[3]/VSS UFSM/MEM_ADDR_reg[6]/VSS UFSM/MEM_ADDR_reg[5]/VSS UFSM/MEM_ADDR_reg[4]/VSS UFSM/MEM_ADDR_reg[3]/VSS UFSM/MEM_ADDR_reg[2]/VSS UFSM/MEM_ADDR_reg[1]/VSS UFSM/MEM_ADDR_reg[0]/VSS UFSM/PREV_CE_reg/VSS UFSM/MEM_OEB_reg[2]/VSS UFSM/MEM_OEB_reg[1]/VSS UFSM/MEM_OEB_reg[0]/VSS UFSM/ctmi_71/VSS UFSM/MEM_CE_reg/VSS UFSM/MEM_CSB_reg[1]/VSS UFSM/MEM_CSB_reg[0]/VSS UFSM/MEM_WEB_reg/VSS UFSM/MEM_CSB_reg[2]/VSS UFSM/ctmi_72/VSS UFSM/MEM_IDATA_reg[6]/VSS UFSM/ctmi_73/VSS UFSM/ctmi_75/VSS UFSM/ctmi_76/VSS UFSM/I_1/VSS UFSM/MEM_CSB_reg[3]/VSS UFSM/ctmi_74/VSS UFSM/ctmi_77/VSS UFSM/ctmi_78/VSS UFSM/ctmi_67/VSS UFSM/ctmi_68/VSS UFSM/ctmi_70/VSS UFSM/MEM_IDATA_reg[7]/VSS}

## Constraints below are generated by snps. Please do not modify.
set derived_upf true

if ($derived_upf) {

set_design_attributes -elements . -internal_attribute _mv_data_status ready
set_design_attributes -elements . -internal_attribute _ldi_supply_nets {VDD \
    VSS} -internal_attribute _ldi_domains {{TOP+VDD+VSS}}

}
set derived_upf false
